In [1]:
# Dependencies and Setup
import pandas as pd

In [2]:
# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [3]:
# Read School and Student Data File and store into Pandas DataFrames
school_data_df = pd.read_csv(school_data_to_load)
student_data_df = pd.read_csv(student_data_to_load)

In [4]:
school_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [5]:
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [6]:
# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data_df, school_data_df, how="left", on=["school_name", "school_name"])

In [7]:
#1a) Create a df listing all of the unique schools
school = ["school_name"]
school
school_data_df.loc[:, school]

              school_name
0       Huang High School
1    Figueroa High School
2     Shelton High School
3   Hernandez High School
4     Griffin High School
5      Wilson High School
6     Cabrera High School
7      Bailey High School
8      Holden High School
9        Pena High School
10     Wright High School
11  Rodriguez High School
12    Johnson High School
13       Ford High School
14     Thomas High School

In [8]:
#1b) Count each school in the newly created dataframe
total_schools = school_data_df["school_name"].count()
total_schools

15

In [9]:
#2a) Create a df listing all of the unique student names
students = ["student_name"]
students
student_data_df.loc[:, students]

            student_name
0           Paul Bradley
1           Victor Smith
2        Kevin Rodriguez
3      Dr. Richard Scott
4             Bonnie Ray
...                  ...
39165       Donna Howard
39166          Dawn Bell
39167     Rebecca Tanner
39168       Desiree Kidd
39169    Carolyn Jackson

[39170 rows x 1 columns]

In [10]:
#2b) Total number of students
total_students = school_data_df["size"].sum()
total_students

39170

In [11]:
#3a) Create a df for the budgets of each school
budgets = ["budget"]
budgets
school_data_df.loc[:, budgets]

     budget
0   1910635
1   1884411
2   1056600
3   3022020
4    917500
5   1319574
6   1081356
7   3124928
8    248087
9    585858
10  1049400
11  2547363
12  3094650
13  1763916
14  1043130

In [12]:
#3b) Calculate total school budget
total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [13]:
#4a) Create a df for all of the math scores
math_scores = ["math_score"]
math_scores
student_data_df.loc[:, math_scores]

       math_score
0              79
1              61
2              60
3              58
4              84
...           ...
39165          90
39166          70
39167          84
39168          90
39169          75

[39170 rows x 1 columns]

In [14]:
#4b) Calculate the average math score
math_avg = student_data_df["math_score"].mean()
math_avg

78.98537145774827

In [15]:
#5a) Created a df for all of the reading scores
reading_scores = ["reading_score"]
reading_scores
student_data_df.loc[:, reading_scores]

       reading_score
0                 66
1                 94
2                 90
3                 67
4                 97
...              ...
39165             99
39166             95
39167             73
39168             99
39169             95

[39170 rows x 1 columns]

In [16]:
#5b) Average readings score
reading_avg = student_data_df["reading_score"].mean()
reading_avg

81.87784018381414

In [17]:
#6a) Create a dataframe of math scores >= 70 (True/False)
math_pass = ["math_score"]
math_pass
student_data_df.loc[:, math_scores] >=70

       math_score
0            True
1           False
2           False
3           False
4            True
...           ...
39165        True
39166        True
39167        True
39168        True
39169        True

[39170 rows x 1 columns]

In [18]:
#6b) Passing Math (The percentage of students that passed math.)
math_pass_tot = student_data_df["math_score"].loc[student_data_df["math_score"] >=70].count() 
math_pass_rate = (math_pass_tot/total_students)*100
math_pass_rate

74.9808526933878

In [19]:
#7a) Create a dataframe of math scores >= 70 (True/False)
math_pass = ["math_score"]
math_pass
student_data_df.loc[:, math_scores] >=70

       math_score
0            True
1           False
2           False
3           False
4            True
...           ...
39165        True
39166        True
39167        True
39168        True
39169        True

[39170 rows x 1 columns]

In [20]:
#7b) Passing Reading (The percentage of students that passed reading.)
read_pass_tot = student_data_df["reading_score"].loc[student_data_df["reading_score"] >=70].count()
read_pass_rate = (read_pass_tot/total_students)*100
read_pass_rate

85.80546336482001

In [21]:
#8a) Create a dataframe of reading scores >= 70
math_read_pass_df = ["math_score","reading_score"]
math_read_pass_df
student_data_df.loc[(student_data_df["reading_score"] >=70) & (student_data_df["math_score"] >=70)]

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
8,8,Michael Roth,M,10th,Huang High School,95,87
9,9,Matthew Greene,M,10th,Huang High School,96,84
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [22]:
#8b) Overall Passing (The percentage of students that passed math and reading.)
#Split into two -- math pass rate and read pass rate
math_read_pass_rate_tot = student_data_df[(student_data_df["reading_score"] >=70) & (student_data_df["math_score"] >=70)]['Student ID'].count()/total_students*100
math_read_pass_rate_tot

65.17232575950983

In [23]:
# create dataframe to hold results
summary_table = pd.DataFrame(
    {"Total Schools":[total_schools],
     "Total Students": f"{total_students:,}",
     "Total Budget": f"${total_budget:,.2f}",
     "Average Math Score": f"{math_avg:,.2f}",
     "Average Reading Score": f"{reading_avg:.2f}",
     "% Passing Math": f"{math_pass_rate:.2f}",
     "% Passing Reading": f"{read_pass_rate:.2f}",
     "% Overall Passing": f"{math_read_pass_rate_tot: .2f}",})
    
summary_table

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.99,81.88,74.98,85.81,65.17

In [24]:
#Part 2 - School Summary
#Create an overview table that summarizes key metrics about 
#each school, including:

In [25]:
#2-1)Create a table with school names
#use sext_index and groupby
unique_school_name = ["school_name"]
unique_school_name
school_data_df.loc[:, unique_school_name]

              school_name
0       Huang High School
1    Figueroa High School
2     Shelton High School
3   Hernandez High School
4     Griffin High School
5      Wilson High School
6     Cabrera High School
7      Bailey High School
8      Holden High School
9        Pena High School
10     Wright High School
11  Rodriguez High School
12    Johnson High School
13       Ford High School
14     Thomas High School

In [26]:
#2-2) Create table with school names & school type
#unique_school_type = school_data_df.set_index(["school_name"])["type"]
unique_school_type = ["school_name", "type"]
unique_school_type
school_data_df.loc[:, "type"]

0     District
1     District
2      Charter
3     District
4      Charter
5      Charter
6      Charter
7     District
8      Charter
9      Charter
10     Charter
11    District
12    District
13    District
14     Charter
Name: type, dtype: object

In [27]:
#2-3) Create table with count of the total number of students
student_count_tot = ["school_name", "size"]
student_count_tot
school_data_df.loc[:, student_count_tot]

              school_name  size
0       Huang High School  2917
1    Figueroa High School  2949
2     Shelton High School  1761
3   Hernandez High School  4635
4     Griffin High School  1468
5      Wilson High School  2283
6     Cabrera High School  1858
7      Bailey High School  4976
8      Holden High School   427
9        Pena High School   962
10     Wright High School  1800
11  Rodriguez High School  3999
12    Johnson High School  4761
13       Ford High School  2739
14     Thomas High School  1635

In [28]:
#2-4) Create a table with total school budget by highschool
#Total School Budget
school_budget_tot = ["school_name", "budget"]
school_budget_tot
school_data_df.loc[:, school_budget_tot]

              school_name   budget
0       Huang High School  1910635
1    Figueroa High School  1884411
2     Shelton High School  1056600
3   Hernandez High School  3022020
4     Griffin High School   917500
5      Wilson High School  1319574
6     Cabrera High School  1081356
7      Bailey High School  3124928
8      Holden High School   248087
9        Pena High School   585858
10     Wright High School  1049400
11  Rodriguez High School  2547363
12    Johnson High School  3094650
13       Ford High School  1763916
14     Thomas High School  1043130

In [29]:
#2-5) Create table with total budget per student
student_budget = ["school_name", "budget"]
student_budget
school_data_df.loc[:, student_budget]

              school_name   budget
0       Huang High School  1910635
1    Figueroa High School  1884411
2     Shelton High School  1056600
3   Hernandez High School  3022020
4     Griffin High School   917500
5      Wilson High School  1319574
6     Cabrera High School  1081356
7      Bailey High School  3124928
8      Holden High School   248087
9        Pena High School   585858
10     Wright High School  1049400
11  Rodriguez High School  2547363
12    Johnson High School  3094650
13       Ford High School  1763916
14     Thomas High School  1043130

In [30]:
#2-6) Create a table with the average math score per student
#math_avg = school_name["math_score"]
#math_avg.mean()

math_avg_per_student = ["total_student", "math_score"]
math_avg_per_student
student_data_df.loc[:, math_avg_per_student]

KeyError: "Passing list-likes to .loc or [] with any missing labels is no longer supported. The following labels were missing: Index(['total_student'], dtype='object'). See https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike"

In [ ]:
#% Passing Math (The percentage of students that passed math.)
pass_math_percent = school_data_complete[school_data_complete['math_score'] >= 70].groupby('school_name')['Student ID'].count()/total_student*100

In [ ]:
#% Passing Reading (The percentage of students that passed reading.)
pass_read_percent = school_data_complete[school_data_complete['reading_score'] >= 70].groupby('school_name')['Student ID'].count()/total_student*100

In [ ]:
#% Overall Passing (The percentage of students that passed math and reading.)
overall_pass = school_data_complete[(school_data_complete['reading_score'] >= 70) & (school_data_complete['math_score'] >= 70)].groupby('school_name')['Student ID'].count()/total_student*100

In [ ]:
# create dataframe to hold results
summary_table = pd.DataFrame({
     "School Type": type,
     "Total Students": total_students,
     "Total Budget": total_budget,
     "Average Math Score": math_avg,
     "Average Reading Score": read_avg,
     "% Passing Math": math_pass_rate,
     "% Passing Reading": read_pass_rate,
     "% Overall Passing": math_read_pass_rate_tot})
    
summary_table

In [ ]:
#munging
school_summary = school_summary[['School Type', 
                          'Total Students', 
                          'Total School Budget', 
                          'Per Student Budget', 
                          'Average Math Score', 
                          'Average Reading Score',
                          '% Passing Math',
                          '% Passing Reading',
                          '% Overall Passing']]

In [ ]:
#formatting
school_summary.style.format({'Total Students': '{:}',
                          "Total School Budget": "${:,.2f}",
                          "Per Student Budget": "${:.2f}",
                          'Average Math Score': "{:6f}", 
                          'Average Reading Score': "{:6f}", 
                          "% Passing Math": "{:6f}", 
                          "% Passing Reading": "{:6f}"})

In [ ]:
#create a pandas series for each grade
freshmanR = school_data_complete.loc[school_data_complete["grade"]=="9th"].groupby("school_name")["reading_score"].mean()
sophmoreR = school_data_complete.loc[school_data_complete["grade"]=="10th"].groupby("school_name")["reading_score"].mean()
juniorR = school_data_complete.loc[school_data_complete["grade"]=="11th"].groupby("school_name")["reading_score"].mean()
seniorR = school_data_complete.loc[school_data_complete["grade"]=="12th"].groupby("school_name")["reading_score"].mean() readingscores_df = pd.DataFrame({"9th": freshmanR,
                              "10th": sophmoreR,
                              "11th": juniorR,
                              "12th": seniorR})
readingscores_df

In [ ]:
ninth_reading = student_data.loc[student_data['grade'] == '9th'].groupby('school_name')["reading_score"].mean()
tenth_reading = student_data.loc[student_data['grade'] == '10th'].groupby('school_name')["reading_score"].mean()
eleventh_reading = student_data.loc[student_data['grade'] == '11th'].groupby('school_name')["reading_score"].mean()
twelfth_reading = student_data.loc[student_data['grade'] == '12th'].groupby('school_name')["reading_score"].mean()

#merges the reading score averages by school and grade together
reading_scores = pd.DataFrame({
        "9th": ninth_reading,
        "10th": tenth_reading,
        "11th": eleventh_reading,
        "12th": twelfth_reading
})
reading_scores = reading_scores[['9th', '10th', '11th', '12th']]
reading_scores.index.name = "School Name"

#format
reading_scores.style.format({'9th': '{:.6f}', 
                             "10th": '{:.6f}', 
                             "11th": "{:.6f}", 
                             "12th": "{:.6f}"})

In [ ]:

# create spending bins


bins = [0, 584, 629, 644, 675]
group_name = ["<$584", "$585-629", "$630-644", "$645-675"]

school_data_complete['spending_bins'] = pd.cut(school_data_complete['budget']/school_data_complete['size'], bins, labels = group_name)

#group by spending
by_spending = school_data_complete.groupby('spending_bins')


avg_math = by_spending['math_score'].mean()

avg_read = by_spending['reading_score'].mean()
pass_math = school_data_complete[school_data_complete['math_score'] >= 70].groupby('spending_bins')['Student ID'].count()/by_spending['Student ID'].count()*100
pass_read = school_data_complete[school_data_complete['reading_score'] >= 70].groupby('spending_bins')['Student ID'].count()/by_spending['Student ID'].count()*100
overall = school_data_complete[(school_data_complete['reading_score'] >= 70) & (school_data_complete['math_score'] >= 70)].groupby('spending_bins')['Student ID'].count()/by_spending['Student ID'].count()*100
    
# df build            
scores_by_spend = pd.DataFrame({
    "Average Math Score": avg_math,
    "Average Reading Score": avg_read,
    "% Passing Math": pass_math,
    "% Passing Reading": pass_read,
    "% Overall Passing": overall
            
})
            
#reorder columns
scores_by_spend = scores_by_spend[[
    "Average Math Score",
    "Average Reading Score",
    "% Passing Math",
    "% Passing Reading",
    "% Overall Passing"
]]

scores_by_spend.index.name = "Per Student Budget"


#formating
scores_by_spend.style.format({'Average Math Score': '{:.2f}', 
                              'Average Reading Score': '{:.2f}', 
                              '% Passing Math': '{:.2f}', 
                              '% Passing Reading':'{:.2f}', 
                              '% Overall Passing': '{:.2f}'})

In [ ]:

# create size bins
bins = [0, 1000, 1999,5000]
group_name = ["Small (<1000)", "Medium (1000-2000)" , "Large (2000-5000)"]
school_data_complete['size_bins'] = pd.cut(school_data_complete['size'], bins, labels = group_name)

#group by spending
by_size = school_data_complete.groupby('size_bins')

#calculations 
average_math_score = by_size['math_score'].mean()
average_reading_score = by_size['math_score'].mean()
pass_math_percent = school_data_complete[school_data_complete['math_score'] >= 70].groupby('size_bins')['Student ID'].count()/by_size['Student ID'].count()*100
pass_read_percent = school_data_complete[school_data_complete['reading_score'] >= 70].groupby('size_bins')['Student ID'].count()/by_size['Student ID'].count()*100
overall = school_data_complete[(school_data_complete['reading_score'] >= 70) & (school_data_complete['math_score'] >= 70)].groupby('size_bins')['Student ID'].count()/by_size['Student ID'].count()*100

            
# df build            
scores_by_size = pd.DataFrame({
    "Average Math Score": average_math_score,
    "Average Reading Score": average_reading_score,
    '% Passing Math': pass_math_percent,
    '% Passing Reading': pass_read_percent,
    '% Overall Passing': overall
            
})
            
#reorder columns
scores_by_size = scores_by_size[[
    "Average Math Score",
    "Average Reading Score",
    '% Passing Math',
    '% Passing Reading',
    '% Overall Passing'
]]

scores_by_size.index.name = "Total Students"
scores_by_size = scores_by_size.reindex(group_name)

#formating
scores_by_size.style.format({'Average Math Score': '{:.6f}', 
                              'Average Reading Score': '{:.6f}', 
                              '% Passing Math': '{:.6f}', 
                              '% Passing Reading':'{:.6f}', 
                              '% Overall Passing': '{:.6f}'})

In [ ]:

# group by type of school
schoo_type = school_data_complete.groupby("type")

#calculations 
average_math_score = schoo_type['math_score'].mean()
average_reading_score = schoo_type['math_score'].mean()
pass_math_percent = school_data_complete[school_data_complete['math_score'] >= 70].groupby('type')['Student ID'].count()/schoo_type['Student ID'].count()*100
pass_read_percent = school_data_complete[school_data_complete['reading_score'] >= 70].groupby('type')['Student ID'].count()/schoo_type['Student ID'].count()*100
overall = school_data_complete[(school_data_complete['reading_score'] >= 70) & (school_data_complete['math_score'] >= 70)].groupby('type')['Student ID'].count()/schoo_type['Student ID'].count()*100

# df build            
scores_schoo_type = pd.DataFrame({
    "Average Math Score": average_math_score,
    "Average Reading Score": average_reading_score,
    '% Passing Math': pass_math_percent,
    '% Passing Reading': pass_read_percent,
    "% Overall Passing": overall})
    
#reorder columns
scores_schoo_type = scores_schoo_type[[
    "Average Math Score",
    "Average Reading Score",
    '% Passing Math',
    '% Passing Reading',
    "% Overall Passing"
]]
scores_schoo_type.index.name = "Type of School"


#formating
scores_schoo_type.style.format({'Average Math Score': '{:.6f}', 
                              'Average Reading Score': '{:.6f}', 
                              '% Passing Math': '{:.6f}', 
                              '% Passing Reading':'{:.6f}', 
                              '% Overall Passing': '{:.6f}'})